{
    "base_model_name_or_path": "Qwen/Qwen2.5-3B-Instruct",
    "peft_type": "LORA",
    "r": 8,
    "lora_alpha": 16,
    "lora_dropout": 0.05,
    "target_modules": [
        "q_proj",
        "v_proj"
    ],
    "bias": "none"
}